# Kelvin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Kelvin Property
SymbolTypeId Class See Also
---
Symbol K, indicating unit Kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Kelvin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Kelvin As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Kelvin {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace